nxp-mcuxpresso/mcux-soc-svd/MCXA265/MCXA265.xml
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PID31</name>
              <description>Port Input Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pid0</name>
                  <description>Configured for general-purpose input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pid1</name>
                  <description>Disabled for general-purpose input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PDR[%s]</name>
          <description>Pin Data</description>
          <addressOffset>0x60</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PD</name>
              <description>Pin Data (I/O)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pd0</name>
                  <description>Logic zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pd1</name>
                  <description>Logic one</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR0</name>
          <description>Interrupt Control 0</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQC</name>
              <description>Interrupt Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>irqc0</name>
                  <description>ISF is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc1</name>
                  <description>ISF and DMA request on rising edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc2</name>
                  <description>ISF and DMA request on falling edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc3</name>
                  <description>ISF and DMA request on either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc5</name>
                  <description>ISF sets on rising edge</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc6</name>
                  <description>ISF sets on falling edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc7</name>
                  <description>ISF sets on either edge</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc8</name>
                  <description>ISF and interrupt when logic 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc9</name>
                  <description>ISF and interrupt on rising edge</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc10</name>
                  <description>ISF and interrupt on falling edge</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc11</name>
                  <description>ISF and Interrupt on either edge</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc12</name>
                  <description>ISF and interrupt when logic 1</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc13</name>
                  <description>Enable active-high trigger output; ISF on rising edge (pin state is ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc14</name>
                  <description>Enable active-low trigger output; ISF on falling edge (pin state is inverted and ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>isf0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>isf1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR1</name>
          <description>Interrupt Control 1</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQC</name>
              <description>Interrupt Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>irqc0</name>
                  <description>ISF is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc1</name>
                  <description>ISF and DMA request on rising edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc2</name>
                  <description>ISF and DMA request on falling edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc3</name>
                  <description>ISF and DMA request on either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc5</name>
                  <description>ISF sets on rising edge</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc6</name>
                  <description>ISF sets on falling edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc7</name>
                  <description>ISF sets on either edge</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc8</name>
                  <description>ISF and interrupt when logic 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc9</name>
                  <description>ISF and interrupt on rising edge</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc10</name>
                  <description>ISF and interrupt on falling edge</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc11</name>
                  <description>ISF and Interrupt on either edge</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc12</name>
                  <description>ISF and interrupt when logic 1</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc13</name>
                  <description>Enable active-high trigger output; ISF on rising edge (pin state is ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc14</name>
                  <description>Enable active-low trigger output; ISF on falling edge (pin state is inverted and ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>isf0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>isf1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR2</name>
          <description>Interrupt Control 2</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQC</name>
              <description>Interrupt Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>irqc0</name>
                  <description>ISF is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc1</name>
                  <description>ISF and DMA request on rising edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc2</name>
                  <description>ISF and DMA request on falling edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc3</name>
                  <description>ISF and DMA request on either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc5</name>
                  <description>ISF sets on rising edge</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc6</name>
                  <description>ISF sets on falling edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc7</name>
                  <description>ISF sets on either edge</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc8</name>
                  <description>ISF and interrupt when logic 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc9</name>
                  <description>ISF and interrupt on rising edge</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc10</name>
                  <description>ISF and interrupt on falling edge</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc11</name>
                  <description>ISF and Interrupt on either edge</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc12</name>
                  <description>ISF and interrupt when logic 1</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc13</name>
                  <description>Enable active-high trigger output; ISF on rising edge (pin state is ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc14</name>
                  <description>Enable active-low trigger output; ISF on falling edge (pin state is inverted and ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>isf0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>isf1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR3</name>
          <description>Interrupt Control 3</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQC</name>
              <description>Interrupt Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>irqc0</name>
                  <description>ISF is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc1</name>
                  <description>ISF and DMA request on rising edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc2</name>
                  <description>ISF and DMA request on falling edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc3</name>
                  <description>ISF and DMA request on either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc5</name>
                  <description>ISF sets on rising edge</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc6</name>
                  <description>ISF sets on falling edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc7</name>
                  <description>ISF sets on either edge</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc8</name>
                  <description>ISF and interrupt when logic 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc9</name>
                  <description>ISF and interrupt on rising edge</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc10</name>
                  <description>ISF and interrupt on falling edge</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc11</name>
                  <description>ISF and Interrupt on either edge</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc12</name>
                  <description>ISF and interrupt when logic 1</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc13</name>
                  <description>Enable active-high trigger output; ISF on rising edge (pin state is ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>irqc14</name>
                  <description>Enable active-low trigger output; ISF on falling edge (pin state is inverted and ORed with other enabled triggers to generate the output trigger for use by other peripherals)</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>isf0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>isf1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
